/**
 * Created by m1833 on 2018/8/13.
 */
export const data={
    "code": "200",
    "data": {
    "professionList": [
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "000101",
                            "des": "机关团体内勤人员",
                            "val": 1
                        },
                        {
                            "code": "000102",
                            "des": "机关团体外勤人员（从事联系工作）",
                            "val": 1
                        }
                    ],
                    "des": "0001机关"
                },
                {
                    "children": [
                        {
                            "code": "000201",
                            "des": "工厂负责人、私营企业主（不亲自作业）",
                            "val": 1
                        },
                        {
                            "code": "000202",
                            "des": "工厂、企业部门经理\主管（不亲自作业）",
                            "val": 1
                        },
                        {
                            "code": "000203",
                            "des": "工厂、企业一般内勤（不从事危险工作）",
                            "val": 1
                        }
                    ],
                    "des": "0002工厂、企业"
                }
            ],
            "des": "00一般职业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "010101",
                            "des": "农场经营者（不亲自作业）",
                            "val": 1
                        },
                        {
                            "code": "010102",
                            "des": "农场经营者（亲自作业）",
                            "val": 2
                        },
                        {
                            "code": "010103",
                            "des": "农夫",
                            "val": 2
                        },
                        {
                            "code": "010104",
                            "des": "长短工",
                            "val": 3
                        },
                        {
                            "code": "010105",
                            "des": "果农",
                            "val": 2
                        },
                        {
                            "code": "010106",
                            "des": "葡萄园农工",
                            "val": 2
                        },
                        {
                            "code": "010107",
                            "des": "苗圃、花圃栽培人员",
                            "val": 2
                        },
                        {
                            "code": "010108",
                            "des": "天然橡胶、剑麻种植人员",
                            "val": 2
                        },
                        {
                            "code": "010109",
                            "des": "割胶工人",
                            "val": 3
                        },
                        {
                            "code": "010110",
                            "des": "糖厂技工",
                            "val": 3
                        },
                        {
                            "code": "010111",
                            "des": "采茶工人",
                            "val": 2
                        },
                        {
                            "code": "010112",
                            "des": "茶叶、蔬菜加工人员",
                            "val": 2
                        },
                        {
                            "code": "010113",
                            "des": "竹、藤、麻、棕、草制品加工人员",
                            "val": 2
                        },
                        {
                            "code": "010114",
                            "des": "棉花加工人员",
                            "val": 2
                        },
                        {
                            "code": "010115",
                            "des": "特种植物原料加工人员",
                            "val": 2
                        },
                        {
                            "code": "010116",
                            "des": "中草药种植人员",
                            "val": 2
                        },
                        {
                            "code": "010117",
                            "des": "中草药采摘人员",
                            "val": 4
                        },
                        {
                            "code": "010118",
                            "des": "牧草培育、加工人员",
                            "val": 2
                        }
                    ],
                    "des": "0101农业"
                },
                {
                    "children": [
                        {
                            "code": "010201",
                            "des": "农业技师、指导员",
                            "val": 1
                        },
                        {
                            "code": "010202",
                            "des": "农业试验人员",
                            "val": 1
                        },
                        {
                            "code": "010203",
                            "des": "农业机械操作\维修人员",
                            "val": 2
                        },
                        {
                            "code": "010204",
                            "des": "农用太阳能设施人员",
                            "val": 3
                        },
                        {
                            "code": "010205",
                            "des": "喷洒农药之飞行员",
                            "val": 6
                        },
                        {
                            "code": "010206",
                            "des": "沼气生产管理人员",
                            "val": 1
                        },
                        {
                            "code": "010207",
                            "des": "沼气设备安装、调试、检修人员",
                            "val": 4
                        },
                        {
                            "code": "010208",
                            "des": "沼气工程施工人员",
                            "val": 4
                        }
                    ],
                    "des": "0102农技类"
                },
                {
                    "children": [
                        {
                            "code": "010301",
                            "des": "饲养家禽家畜人员",
                            "val": 2
                        },
                        {
                            "code": "010302",
                            "des": "昆虫（蜜蜂）饲养人员",
                            "val": 2
                        },
                        {
                            "code": "010303",
                            "des": "特种养殖(蛇、鳄鱼、蝎等)人员",
                            "val": 2
                        },
                        {
                            "code": "010304",
                            "des": "畜牧场经营者（不亲自作业）",
                            "val": 1
                        },
                        {
                            "code": "010305",
                            "des": "畜牧场经营者（亲自作业）",
                            "val": 2
                        },
                        {
                            "code": "010306",
                            "des": "畜牧作业人员",
                            "val": 2
                        },
                        {
                            "code": "010307",
                            "des": "实验动物饲养人员",
                            "val": 2
                        },
                        {
                            "code": "010308",
                            "des": "驯犬人员",
                            "val": 2
                        },
                        {
                            "code": "010309",
                            "des": "兽医、兽药技术人员",
                            "val": 2
                        },
                        {
                            "code": "010310",
                            "des": "动物检疫\检验\化验人员",
                            "val": 1
                        },
                        {
                            "code": "010311",
                            "des": "牲畜商贩",
                            "val": 2
                        }
                    ],
                    "des": "0103畜牧业"
                }
            ],
            "des": "01农牧业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "020101",
                            "des": "渔场经营者（不亲自作业）",
                            "val": 1
                        },
                        {
                            "code": "020102",
                            "des": "渔场经营者（亲自作业）",
                            "val": 2
                        },
                        {
                            "code": "020103",
                            "des": "渔场作业人员",
                            "val": 2
                        },
                        {
                            "code": "020104",
                            "des": "养殖工人（内陆）",
                            "val": 3
                        },
                        {
                            "code": "020105",
                            "des": "养殖工人（沿海）",
                            "val": 5
                        },
                        {
                            "code": "020106",
                            "des": "捕鱼人（内陆）",
                            "val": 4
                        },
                        {
                            "code": "020107",
                            "des": "捕鱼人（沿海）",
                            "val": 5
                        },
                        {
                            "code": "020108",
                            "des": "热带鱼养殖者、水族馆经营者",
                            "val": 1
                        },
                        {
                            "code": "020109",
                            "des": "水产实验人员（室内）",
                            "val": 1
                        },
                        {
                            "code": "020110",
                            "des": "水产实验人员（室外）",
                            "val": 1
                        },
                        {
                            "code": "020111",
                            "des": "水\海产品加工人员",
                            "val": 2
                        },
                        {
                            "code": "020112",
                            "des": "水生动植物采集人员",
                            "val": 4
                        },
                        {
                            "code": "020113",
                            "des": "渔网具装配人员",
                            "val": 2
                        }
                    ],
                    "des": "0201内陆渔业"
                },
                {
                    "children": [
                        {
                            "code": "020201",
                            "des": "远洋渔业船员",
                            "val": 6
                        },
                        {
                            "code": "020202",
                            "des": "近海渔船船员",
                            "val": 6
                        }
                    ],
                    "des": "0202海上渔业"
                },
                {
                    "children": [
                        {
                            "code": "020301",
                            "des": "领班",
                            "val": 2
                        },
                        {
                            "code": "020302",
                            "des": "水\海产品加工人员",
                            "val": 2
                        },
                        {
                            "code": "020303",
                            "des": "营业员",
                            "val": 1
                        },
                        {
                            "code": "020304",
                            "des": "搬运工",
                            "val": 3
                        }
                    ],
                    "des": "0203水产品"
                }
            ],
            "des": "02渔业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "030101",
                            "des": "领班",
                            "val": 4
                        },
                        {
                            "code": "030102",
                            "des": "监工",
                            "val": 4
                        },
                        {
                            "code": "030103",
                            "des": "伐木工人",
                            "val": 6
                        },
                        {
                            "code": "030104",
                            "des": "锯木工人",
                            "val": 6
                        },
                        {
                            "code": "030105",
                            "des": "运材车辆之司机及押运人员",
                            "val": 4
                        },
                        {
                            "code": "030106",
                            "des": "起重机之操作人员",
                            "val": 5
                        },
                        {
                            "code": "030107",
                            "des": "装运工人、挂钩人",
                            "val": 5
                        },
                        {
                            "code": "030108",
                            "des": "木材供应站管理人员",
                            "val": 2
                        },
                        {
                            "code": "030109",
                            "des": "木材供应站营业人员",
                            "val": 3
                        }
                    ],
                    "des": "0301森林砍伐业"
                },
                {
                    "children": [
                        {
                            "code": "030201",
                            "des": "木材工厂现场职员",
                            "val": 2
                        },
                        {
                            "code": "030202",
                            "des": "领班",
                            "val": 2
                        },
                        {
                            "code": "030203",
                            "des": "分级员",
                            "val": 2
                        },
                        {
                            "code": "030204",
                            "des": "检查员",
                            "val": 2
                        },
                        {
                            "code": "030205",
                            "des": "标记员",
                            "val": 2
                        },
                        {
                            "code": "030206",
                            "des": "磅秤员",
                            "val": 2
                        },
                        {
                            "code": "030207",
                            "des": "锯木工人",
                            "val": 4
                        },
                        {
                            "code": "030208",
                            "des": "防腐剂工人",
                            "val": 2
                        },
                        {
                            "code": "030209",
                            "des": "木材储藏槽工人",
                            "val": 3
                        },
                        {
                            "code": "030210",
                            "des": "木材搬运工人",
                            "val": 4
                        },
                        {
                            "code": "030211",
                            "des": "吊车操作人员",
                            "val": 3
                        },
                        {
                            "code": "030212",
                            "des": "人造板制造人员",
                            "val": 2
                        }
                    ],
                    "des": "0302木材加工业"
                },
                {
                    "children": [
                        {
                            "code": "030301",
                            "des": "领班",
                            "val": 2
                        },
                        {
                            "code": "030302",
                            "des": "山地造林工人",
                            "val": 2
                        },
                        {
                            "code": "030303",
                            "des": "山林管理人员",
                            "val": 2
                        },
                        {
                            "code": "030304",
                            "des": "森林防火人员",
                            "val": 4
                        },
                        {
                            "code": "030305",
                            "des": "平地育苗工人",
                            "val": 2
                        },
                        {
                            "code": "030306",
                            "des": "实验室育苗栽培人员",
                            "val": 2
                        },
                        {
                            "code": "030307",
                            "des": "森林病虫害防治人员",
                            "val": 2
                        }
                    ],
                    "des": "0303造林业"
                },
                {
                    "children": [
                        {
                            "code": "030401",
                            "des": "野生动物保护员",
                            "val": 4
                        },
                        {
                            "code": "030402",
                            "des": "野生植物保护员",
                            "val": 4
                        },
                        {
                            "code": "030403",
                            "des": "自然保护区巡护监测员",
                            "val": 3
                        },
                        {
                            "code": "030404",
                            "des": "动植物标本员",
                            "val": 3
                        }
                    ],
                    "des": "0304自然保护"
                }
            ],
            "des": "03木材森林业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "040101",
                            "des": "经营者（不到现场者）",
                            "val": 2
                        },
                        {
                            "code": "040102",
                            "des": "经营者（现场监督者）",
                            "val": 3
                        },
                        {
                            "code": "040103",
                            "des": "一般内勤人员",
                            "val": 2
                        },
                        {
                            "code": "040104",
                            "des": "矿业工程师、技师、领班",
                            "val": 4
                        },
                        {
                            "code": "040105",
                            "des": "矿工（井下工作）",
                            "val": 0
                        },
                        {
                            "code": "040106",
                            "des": "地面采矿工人",
                            "val": 5
                        },
                        {
                            "code": "040107",
                            "des": "工矿安全人员",
                            "val": 3
                        },
                        {
                            "code": "040108",
                            "des": "支护工人",
                            "val": 0
                        },
                        {
                            "code": "040109",
                            "des": "矿物采掘爆破工人",
                            "val": 0
                        },
                        {
                            "code": "040110",
                            "des": "矿井开掘工人",
                            "val": 0
                        },
                        {
                            "code": "040111",
                            "des": "矿井通风工人",
                            "val": 6
                        },
                        {
                            "code": "040112",
                            "des": "井筒冻结工人",
                            "val": 6
                        },
                        {
                            "code": "040113",
                            "des": "钻孔机司机",
                            "val": 5
                        },
                        {
                            "code": "040114",
                            "des": "矿山提升机\架空索道\绞车等操作工",
                            "val": 5
                        },
                        {
                            "code": "040115",
                            "des": "露天采矿挖掘机司机",
                            "val": 5
                        },
                        {
                            "code": "040116",
                            "des": "矿山检查验收人员",
                            "val": 3
                        },
                        {
                            "code": "040117",
                            "des": "矿工头灯充电人员",
                            "val": 2
                        },
                        {
                            "code": "040118",
                            "des": "矿灯\自救器管理人员",
                            "val": 2
                        },
                        {
                            "code": "040119",
                            "des": "火药\雷管管理工",
                            "val": 0
                        },
                        {
                            "code": "040120",
                            "des": "矿山井下抢险\救灾人员",
                            "val": 0
                        }
                    ],
                    "des": "0401矿物开采"
                },
                {
                    "children": [
                        {
                            "code": "040201",
                            "des": "采石业工人",
                            "val": 6
                        },
                        {
                            "code": "040202",
                            "des": "采砂业工人",
                            "val": 5
                        },
                        {
                            "code": "040203",
                            "des": "淘金工人",
                            "val": 5
                        }
                    ],
                    "des": "0402采砂石业"
                },
                {
                    "children": [
                        {
                            "code": "040301",
                            "des": "所有作业人员（潜水人员除外）",
                            "val": 6
                        },
                        {
                            "code": "040302",
                            "des": "潜水人员",
                            "val": 0
                        }
                    ],
                    "des": "0403海上作业"
                },
                {
                    "children": [
                        {
                            "code": "040401",
                            "des": "工程技术人员",
                            "val": 3
                        },
                        {
                            "code": "040402",
                            "des": "钻油井工人",
                            "val": 5
                        },
                        {
                            "code": "040403",
                            "des": "钻井设备\井架安装工人",
                            "val": 5
                        },
                        {
                            "code": "040404",
                            "des": "钻勘设备安装换修保养工",
                            "val": 5
                        },
                        {
                            "code": "040405",
                            "des": "油气井测试工人",
                            "val": 5
                        },
                        {
                            "code": "040406",
                            "des": "油气井清洁保养修护工",
                            "val": 5
                        },
                        {
                            "code": "040407",
                            "des": "采油\气工人",
                            "val": 5
                        },
                        {
                            "code": "040408",
                            "des": "井下作业工人",
                            "val": 0
                        },
                        {
                            "code": "040409",
                            "des": "天然气净化工人",
                            "val": 3
                        },
                        {
                            "code": "040410",
                            "des": "油气输送工人",
                            "val": 3
                        },
                        {
                            "code": "040411",
                            "des": "油气管道保护工人",
                            "val": 4
                        },
                        {
                            "code": "040412",
                            "des": "采油化验工",
                            "val": 3
                        },
                        {
                            "code": "040413",
                            "des": "综合录井工",
                            "val": 3
                        },
                        {
                            "code": "040414",
                            "des": "气测工",
                            "val": 3
                        },
                        {
                            "code": "040415",
                            "des": "油气提炼工",
                            "val": 4
                        },
                        {
                            "code": "040416",
                            "des": "油气熔炼工",
                            "val": 4
                        },
                        {
                            "code": "040417",
                            "des": "蒸馏工",
                            "val": 4
                        },
                        {
                            "code": "040418",
                            "des": "柏油、煤焦油熔炼工",
                            "val": 4
                        }
                    ],
                    "des": "0404陆上油矿开采业、炼造业"
                },
                {
                    "children": [
                        {
                            "code": "040501",
                            "des": "地质探测员（山区，海上）",
                            "val": 5
                        },
                        {
                            "code": "040502",
                            "des": "地质探测员（平地）",
                            "val": 3
                        },
                        {
                            "code": "040503",
                            "des": "工程师",
                            "val": 3
                        },
                        {
                            "code": "040504",
                            "des": "钻探工人",
                            "val": 5
                        },
                        {
                            "code": "040505",
                            "des": "坑探工人",
                            "val": 0
                        },
                        {
                            "code": "040506",
                            "des": "物探工人",
                            "val": 4
                        },
                        {
                            "code": "040507",
                            "des": "海洋地质取样工人",
                            "val": 0
                        },
                        {
                            "code": "040508",
                            "des": "大地\工程测量人员",
                            "val": 3
                        },
                        {
                            "code": "040509",
                            "des": "摄影测量人员",
                            "val": 3
                        },
                        {
                            "code": "040510",
                            "des": "地图制图人员",
                            "val": 1
                        },
                        {
                            "code": "040511",
                            "des": "测绘人员（非海上作业）",
                            "val": 3
                        },
                        {
                            "code": "040512",
                            "des": "海洋测绘人员（海上作业）",
                            "val": 6
                        }
                    ],
                    "des": "0405地质勘测、测量"
                }
            ],
            "des": "04矿业采石业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "050101",
                            "des": "计程车、货运行之负责人（不参与驾驶者）",
                            "val": 1
                        },
                        {
                            "code": "050102",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "050103",
                            "des": "柜台售票员",
                            "val": 1
                        },
                        {
                            "code": "050104",
                            "des": "计程车司机",
                            "val": 3
                        },
                        {
                            "code": "050105",
                            "des": "市区客运车司机及服务员",
                            "val": 2
                        },
                        {
                            "code": "050106",
                            "des": "长途客运车司机及服务员",
                            "val": 4
                        },
                        {
                            "code": "050107",
                            "des": "自用小车司机",
                            "val": 2
                        },
                        {
                            "code": "050108",
                            "des": "自用小客车司机（11座以内的面包车）",
                            "val": 2
                        },
                        {
                            "code": "050109",
                            "des": "自用大客车司机",
                            "val": 2
                        },
                        {
                            "code": "050110",
                            "des": "小型自用货车司机（4吨以下）",
                            "val": 2
                        },
                        {
                            "code": "050111",
                            "des": "小型客货两用司机",
                            "val": 2
                        },
                        {
                            "code": "050112",
                            "des": "自用货车司机和随车工人（4吨以上）",
                            "val": 4
                        },
                        {
                            "code": "050113",
                            "des": "营业用货车司机和随车工人（4吨以上）",
                            "val": 4
                        },
                        {
                            "code": "050114",
                            "des": "营业用货车司机和随车工人（4吨以下）",
                            "val": 4
                        },
                        {
                            "code": "050115",
                            "des": "救护车驾驶员",
                            "val": 3
                        },
                        {
                            "code": "050116",
                            "des": "拖拉机驾驶人员",
                            "val": 4
                        },
                        {
                            "code": "050117",
                            "des": "铁牛车（拼装车）驾驶员、混凝土预拌车驾驶员",
                            "val": 4
                        },
                        {
                            "code": "050118",
                            "des": "砂石车司机、随车工人",
                            "val": 4
                        },
                        {
                            "code": "050119",
                            "des": "工程卡车司机、随车工人",
                            "val": 4
                        },
                        {
                            "code": "050120",
                            "des": "液化气、油罐车随车司机、随车工人",
                            "val": 5
                        },
                        {
                            "code": "050121",
                            "des": "货柜车司机、随车工人",
                            "val": 4
                        },
                        {
                            "code": "050122",
                            "des": "拖吊车驾驶工作人员",
                            "val": 5
                        },
                        {
                            "code": "050123",
                            "des": "搬运工人",
                            "val": 4
                        },
                        {
                            "code": "050124",
                            "des": "游览车司机及服务员",
                            "val": 2
                        },
                        {
                            "code": "050125",
                            "des": "缆车操作员",
                            "val": 3
                        },
                        {
                            "code": "050126",
                            "des": "客运车稽核人员",
                            "val": 2
                        },
                        {
                            "code": "050127",
                            "des": "有摩托车驾照人员",
                            "val": 3
                        },
                        {
                            "code": "050128",
                            "des": "人力三轮车夫",
                            "val": 4
                        },
                        {
                            "code": "050129",
                            "des": "机动三轮车司机",
                            "val": 4
                        },
                        {
                            "code": "050130",
                            "des": "路桥收费站收费员",
                            "val": 1
                        },
                        {
                            "code": "050131",
                            "des": "路桥收费站执勤员",
                            "val": 2
                        }
                    ],
                    "des": "0501公路运输"
                },
                {
                    "children": [
                        {
                            "code": "050201",
                            "des": "站长",
                            "val": 1
                        },
                        {
                            "code": "050202",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "050203",
                            "des": "票房工作人员",
                            "val": 1
                        },
                        {
                            "code": "050204",
                            "des": "播音员",
                            "val": 1
                        },
                        {
                            "code": "050205",
                            "des": "服务台人员",
                            "val": 1
                        },
                        {
                            "code": "050206",
                            "des": "车站检票员",
                            "val": 1
                        },
                        {
                            "code": "050207",
                            "des": "月台工作人员",
                            "val": 2
                        },
                        {
                            "code": "050208",
                            "des": "货运领班",
                            "val": 2
                        },
                        {
                            "code": "050209",
                            "des": "货运搬运工人",
                            "val": 4
                        },
                        {
                            "code": "050210",
                            "des": "车站清洁工",
                            "val": 2
                        },
                        {
                            "code": "050211",
                            "des": "驾驶员",
                            "val": 3
                        },
                        {
                            "code": "050212",
                            "des": "燃料填充员",
                            "val": 3
                        },
                        {
                            "code": "050213",
                            "des": "随车人员（技术员除外）",
                            "val": 2
                        },
                        {
                            "code": "050214",
                            "des": "修护厂技工",
                            "val": 3
                        },
                        {
                            "code": "050215",
                            "des": "修护厂电工",
                            "val": 4
                        },
                        {
                            "code": "050216",
                            "des": "信号工人",
                            "val": 3
                        },
                        {
                            "code": "050217",
                            "des": "通讯工人",
                            "val": 3
                        },
                        {
                            "code": "050218",
                            "des": "仓库管理员",
                            "val": 2
                        },
                        {
                            "code": "050219",
                            "des": "维护工",
                            "val": 3
                        },
                        {
                            "code": "050220",
                            "des": "修路工",
                            "val": 4
                        },
                        {
                            "code": "050221",
                            "des": "平交道看守人员",
                            "val": 2
                        }
                    ],
                    "des": "0502铁路运输"
                },
                {
                    "children": [
                        {
                            "code": "050301",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "050302",
                            "des": "驾驶员",
                            "val": 2
                        },
                        {
                            "code": "050303",
                            "des": "维护工",
                            "val": 3
                        },
                        {
                            "code": "050304",
                            "des": "月台工作人员",
                            "val": 1
                        }
                    ],
                    "des": "0503地铁\轻轨"
                },
                {
                    "children": [
                        {
                            "code": "050401",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "050402",
                            "des": "客货轮船长",
                            "val": 5
                        },
                        {
                            "code": "050403",
                            "des": "轮机长",
                            "val": 5
                        },
                        {
                            "code": "050404",
                            "des": "大副",
                            "val": 5
                        },
                        {
                            "code": "050405",
                            "des": "二副",
                            "val": 5
                        },
                        {
                            "code": "050406",
                            "des": "三副",
                            "val": 5
                        },
                        {
                            "code": "050407",
                            "des": "大管轮",
                            "val": 5
                        },
                        {
                            "code": "050408",
                            "des": "二管轮",
                            "val": 5
                        },
                        {
                            "code": "050409",
                            "des": "三管轮",
                            "val": 5
                        },
                        {
                            "code": "050410",
                            "des": "客货轮事务长",
                            "val": 5
                        },
                        {
                            "code": "050411",
                            "des": "客货轮报务员",
                            "val": 5
                        },
                        {
                            "code": "050412",
                            "des": "客货轮技师",
                            "val": 5
                        },
                        {
                            "code": "050413",
                            "des": "水手长",
                            "val": 6
                        },
                        {
                            "code": "050414",
                            "des": "水手",
                            "val": 6
                        },
                        {
                            "code": "050415",
                            "des": "客货轮医务人员",
                            "val": 5
                        },
                        {
                            "code": "050416",
                            "des": "客货轮厨师",
                            "val": 5
                        },
                        {
                            "code": "050417",
                            "des": "客货轮服务生",
                            "val": 5
                        },
                        {
                            "code": "050418",
                            "des": "客货轮实习生",
                            "val": 5
                        },
                        {
                            "code": "050419",
                            "des": "游览船之驾驶及工作人员",
                            "val": 5
                        },
                        {
                            "code": "050420",
                            "des": "小汽艇之驾驶及工作人员",
                            "val": 5
                        },
                        {
                            "code": "050421",
                            "des": "港口码头工人及领班（陆上作业）",
                            "val": 5
                        },
                        {
                            "code": "050422",
                            "des": "港口码头工人及领班（海上作业）",
                            "val": 6
                        },
                        {
                            "code": "050423",
                            "des": "港口吊车操作员",
                            "val": 5
                        },
                        {
                            "code": "050424",
                            "des": "港口堆高机操作员",
                            "val": 5
                        },
                        {
                            "code": "050425",
                            "des": "港口仓库管理员、理货员",
                            "val": 3
                        },
                        {
                            "code": "050426",
                            "des": "领航员",
                            "val": 5
                        },
                        {
                            "code": "050427",
                            "des": "引水人员",
                            "val": 5
                        },
                        {
                            "code": "050428",
                            "des": "关务人员",
                            "val": 2
                        },
                        {
                            "code": "050429",
                            "des": "稽查人员",
                            "val": 5
                        },
                        {
                            "code": "050430",
                            "des": "缉私人员",
                            "val": 5
                        },
                        {
                            "code": "050431",
                            "des": "拖船驾驶员及工作人员",
                            "val": 5
                        },
                        {
                            "code": "050432",
                            "des": "轮渡驾驶员及工作人员",
                            "val": 5
                        },
                        {
                            "code": "050433",
                            "des": "垃圾船驾驶员及工作人员",
                            "val": 5
                        },
                        {
                            "code": "050434",
                            "des": "救难船员",
                            "val": 6
                        },
                        {
                            "code": "050435",
                            "des": "航标工(灯塔\航标维护保养)",
                            "val": 5
                        }
                    ],
                    "des": "0504航运业"
                },
                {
                    "children": [
                        {
                            "code": "050501",
                            "des": "站长",
                            "val": 1
                        },
                        {
                            "code": "050502",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "050503",
                            "des": "机场播音员",
                            "val": 1
                        },
                        {
                            "code": "050504",
                            "des": "机场服务台人员",
                            "val": 1
                        },
                        {
                            "code": "050505",
                            "des": "关务人员",
                            "val": 2
                        },
                        {
                            "code": "050506",
                            "des": "检查人员",
                            "val": 2
                        },
                        {
                            "code": "050507",
                            "des": "缉私人员",
                            "val": 3
                        },
                        {
                            "code": "050508",
                            "des": "塔台工作人员",
                            "val": 1
                        },
                        {
                            "code": "050509",
                            "des": "航空雷达导航员",
                            "val": 1
                        },
                        {
                            "code": "050510",
                            "des": "航空雷达设备维护人员",
                            "val": 3
                        },
                        {
                            "code": "050511",
                            "des": "航空器材员",
                            "val": 2
                        },
                        {
                            "code": "050512",
                            "des": "航空气象员",
                            "val": 2
                        },
                        {
                            "code": "050513",
                            "des": "机场内交通车司机",
                            "val": 2
                        },
                        {
                            "code": "050514",
                            "des": "行李货运搬运工人",
                            "val": 3
                        },
                        {
                            "code": "050515",
                            "des": "站内清洁工人（室内）",
                            "val": 2
                        },
                        {
                            "code": "050516",
                            "des": "室外清洁工（高墙或天花板）",
                            "val": 6
                        },
                        {
                            "code": "050517",
                            "des": "燃料加添员",
                            "val": 4
                        },
                        {
                            "code": "050518",
                            "des": "飞机维护人员",
                            "val": 3
                        },
                        {
                            "code": "050519",
                            "des": "飞机洗刷人员",
                            "val": 3
                        },
                        {
                            "code": "050520",
                            "des": "机械员",
                            "val": 3
                        },
                        {
                            "code": "050521",
                            "des": "跑道维护工",
                            "val": 3
                        },
                        {
                            "code": "050522",
                            "des": "灯塔修理员",
                            "val": 4
                        },
                        {
                            "code": "050523",
                            "des": "航空票务人员",
                            "val": 2
                        },
                        {
                            "code": "050524",
                            "des": "货运外务员",
                            "val": 2
                        },
                        {
                            "code": "050525",
                            "des": "货运报关人员",
                            "val": 1
                        },
                        {
                            "code": "050526",
                            "des": "理货员",
                            "val": 3
                        },
                        {
                            "code": "050527",
                            "des": "民航喷气式客机飞行员/乘务人员",
                            "val": 4
                        },
                        {
                            "code": "050528",
                            "des": "民航旋翼式客机飞行员/乘务人员",
                            "val": 6
                        },
                        {
                            "code": "050529",
                            "des": "航空公司飞行训练学员",
                            "val": 6
                        },
                        {
                            "code": "050530",
                            "des": "航空摄影人员",
                            "val": 6
                        }
                    ],
                    "des": "0505航空业"
                }
            ],
            "des": "05交通运输业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "060101",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "060102",
                            "des": "外务员",
                            "val": 2
                        },
                        {
                            "code": "060103",
                            "des": "导游",
                            "val": 2
                        }
                    ],
                    "des": "0601旅游业"
                },
                {
                    "children": [
                        {
                            "code": "060201",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "060202",
                            "des": "外务员",
                            "val": 2
                        },
                        {
                            "code": "060203",
                            "des": "收帐员",
                            "val": 2
                        },
                        {
                            "code": "060204",
                            "des": "技工",
                            "val": 2
                        },
                        {
                            "code": "060205",
                            "des": "采购人员",
                            "val": 2
                        },
                        {
                            "code": "060206",
                            "des": "服务人员",
                            "val": 1
                        },
                        {
                            "code": "060207",
                            "des": "柜台人员",
                            "val": 1
                        },
                        {
                            "code": "060208",
                            "des": "厨师",
                            "val": 2
                        }
                    ],
                    "des": "0602宾馆、餐饮业"
                }
            ],
            "des": "06餐旅业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "070101",
                            "des": "承包商",
                            "val": 2
                        },
                        {
                            "code": "070102",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "070103",
                            "des": "建筑师",
                            "val": 2
                        },
                        {
                            "code": "070104",
                            "des": "测量员",
                            "val": 2
                        },
                        {
                            "code": "070105",
                            "des": "制图员",
                            "val": 1
                        },
                        {
                            "code": "070106",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "070107",
                            "des": "监工",
                            "val": 2
                        },
                        {
                            "code": "070108",
                            "des": "引导参观工地人员",
                            "val": 2
                        },
                        {
                            "code": "070109",
                            "des": "工地看守员",
                            "val": 2
                        },
                        {
                            "code": "070110",
                            "des": "领班",
                            "val": 2
                        },
                        {
                            "code": "070111",
                            "des": "短工",
                            "val": 0
                        },
                        {
                            "code": "070112",
                            "des": "鹰架架设工人",
                            "val": 0
                        },
                        {
                            "code": "070113",
                            "des": "凿岩工人",
                            "val": 0
                        },
                        {
                            "code": "070114",
                            "des": "爆破工人",
                            "val": 0
                        },
                        {
                            "code": "070115",
                            "des": "土石方机械操作(推土机\铲运机\挖掘机\打桩机驾驶操作人员)",
                            "val": 4
                        },
                        {
                            "code": "070116",
                            "des": "砌筑工人",
                            "val": 4
                        },
                        {
                            "code": "070117",
                            "des": "泥水匠",
                            "val": 4
                        },
                        {
                            "code": "070118",
                            "des": "磨石工人",
                            "val": 4
                        },
                        {
                            "code": "070119",
                            "des": "洗石工人",
                            "val": 4
                        },
                        {
                            "code": "070120",
                            "des": "混凝土工人",
                            "val": 4
                        },
                        {
                            "code": "070121",
                            "des": "混凝土制品模具工人",
                            "val": 4
                        },
                        {
                            "code": "070122",
                            "des": "钢筋工人",
                            "val": 5
                        },
                        {
                            "code": "070123",
                            "des": "混凝土混合机操作员",
                            "val": 4
                        },
                        {
                            "code": "070124",
                            "des": "防渗墙工人",
                            "val": 4
                        },
                        {
                            "code": "070125",
                            "des": "排水工程人员",
                            "val": 4
                        },
                        {
                            "code": "070126",
                            "des": "防水工程人员",
                            "val": 4
                        },
                        {
                            "code": "070127",
                            "des": "拆屋、迁屋工人",
                            "val": 0
                        }
                    ],
                    "des": "0701土木工程"
                },
                {
                    "children": [
                        {
                            "code": "070201",
                            "des": "承包商",
                            "val": 2
                        },
                        {
                            "code": "070202",
                            "des": "监工",
                            "val": 2
                        },
                        {
                            "code": "070203",
                            "des": "设计制图人员",
                            "val": 1
                        },
                        {
                            "code": "070204",
                            "des": "室内装璜人员",
                            "val": 3
                        },
                        {
                            "code": "070205",
                            "des": "室外装璜人员",
                            "val": 6
                        },
                        {
                            "code": "070206",
                            "des": "室内成套设备装饰工人",
                            "val": 3
                        },
                        {
                            "code": "070207",
                            "des": "木匠(室内)",
                            "val": 3
                        },
                        {
                            "code": "070208",
                            "des": "木匠(室外及高空)",
                            "val": 6
                        },
                        {
                            "code": "070209",
                            "des": "建筑油漆工(室内)",
                            "val": 3
                        },
                        {
                            "code": "070210",
                            "des": "建筑油漆工(室外及高空)",
                            "val": 6
                        },
                        {
                            "code": "070211",
                            "des": "建筑水电工(室内)",
                            "val": 4
                        },
                        {
                            "code": "070212",
                            "des": "建筑水电工(地下)",
                            "val": 6
                        },
                        {
                            "code": "070213",
                            "des": "建筑焊工(室内)",
                            "val": 4
                        },
                        {
                            "code": "070214",
                            "des": "建筑焊工(室外及高空)",
                            "val": 6
                        },
                        {
                            "code": "070215",
                            "des": "铝\铁门窗装修工人",
                            "val": 5
                        },
                        {
                            "code": "070216",
                            "des": "石棉瓦\浪板安装工人",
                            "val": 5
                        },
                        {
                            "code": "070217",
                            "des": "玻璃幕墙安装工人",
                            "val": 0
                        },
                        {
                            "code": "070218",
                            "des": "水暧工",
                            "val": 3
                        },
                        {
                            "code": "070219",
                            "des": "古建筑结构施工工人",
                            "val": 4
                        },
                        {
                            "code": "070220",
                            "des": "古建筑装饰工人",
                            "val": 4
                        }
                    ],
                    "des": "0702装饰装修"
                },
                {
                    "children": [
                        {
                            "code": "070301",
                            "des": "电梯升降梯安装工人",
                            "val": 4
                        },
                        {
                            "code": "070302",
                            "des": "电梯升降梯修理及维护工",
                            "val": 4
                        },
                        {
                            "code": "070303",
                            "des": "电梯升降梯操作员（不包括矿场使用者）",
                            "val": 3
                        },
                        {
                            "code": "070304",
                            "des": "机械设备安装工人",
                            "val": 3
                        },
                        {
                            "code": "070305",
                            "des": "电气设备安装工人",
                            "val": 3
                        },
                        {
                            "code": "070306",
                            "des": "防火系统\报警器安装人员",
                            "val": 3
                        },
                        {
                            "code": "070307",
                            "des": "空调安装维修人员（室内作业）",
                            "val": 3
                        },
                        {
                            "code": "070308",
                            "des": "空调安装维修人员（室外作业）",
                            "val": 6
                        },
                        {
                            "code": "070309",
                            "des": "有关高压电之工作人员",
                            "val": 6
                        }
                    ],
                    "des": "0703工程机械设备安装"
                },
                {
                    "children": [
                        {
                            "code": "070401",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "070402",
                            "des": "领班，监工",
                            "val": 2
                        },
                        {
                            "code": "070403",
                            "des": "道路工程机械操作员",
                            "val": 4
                        },
                        {
                            "code": "070404",
                            "des": "道路工程车辆驾驶员",
                            "val": 4
                        },
                        {
                            "code": "070405",
                            "des": "山地铺设工人",
                            "val": 5
                        },
                        {
                            "code": "070406",
                            "des": "平地铺设工人",
                            "val": 4
                        },
                        {
                            "code": "070407",
                            "des": "维护工人",
                            "val": 4
                        },
                        {
                            "code": "070408",
                            "des": "电线架设及维护工人",
                            "val": 5
                        },
                        {
                            "code": "070409",
                            "des": "管道铺设及维护工人",
                            "val": 4
                        },
                        {
                            "code": "070410",
                            "des": "高速公路工程人员",
                            "val": 4
                        },
                        {
                            "code": "070411",
                            "des": "线桥专用机械操作工人",
                            "val": 4
                        },
                        {
                            "code": "070412",
                            "des": "铁路舟桥工人",
                            "val": 5
                        },
                        {
                            "code": "070413",
                            "des": "道岔制修工人",
                            "val": 4
                        },
                        {
                            "code": "070414",
                            "des": "枕木处理工人",
                            "val": 4
                        },
                        {
                            "code": "070415",
                            "des": "桥梁工程人员",
                            "val": 5
                        },
                        {
                            "code": "070416",
                            "des": "隧道工程人员",
                            "val": 5
                        },
                        {
                            "code": "070417",
                            "des": "地铁工程人员",
                            "val": 5
                        }
                    ],
                    "des": "0704道路、铁路、桥梁建造"
                },
                {
                    "children": [
                        {
                            "code": "070501",
                            "des": "海港港口工程人员",
                            "val": 5
                        },
                        {
                            "code": "070502",
                            "des": "水坝、挖井工程人员",
                            "val": 6
                        },
                        {
                            "code": "070503",
                            "des": "挖泥船工人",
                            "val": 5
                        },
                        {
                            "code": "070504",
                            "des": "潜水工作人员",
                            "val": 0
                        },
                        {
                            "code": "070505",
                            "des": "爆破工作人员",
                            "val": 0
                        }
                    ],
                    "des": "0705其他工程"
                }
            ],
            "des": "07建筑工程业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "080101",
                            "des": "技师",
                            "val": 3
                        },
                        {
                            "code": "080102",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "080103",
                            "des": "工人",
                            "val": 4
                        }
                    ],
                    "des": "0801钢铁、铝、铜金属炼造"
                },
                {
                    "children": [
                        {
                            "code": "080201",
                            "des": "监工、领班",
                            "val": 2
                        },
                        {
                            "code": "080202",
                            "des": "模具设计人员",
                            "val": 2
                        },
                        {
                            "code": "080203",
                            "des": "制模工",
                            "val": 2
                        },
                        {
                            "code": "080204",
                            "des": "焊接工",
                            "val": 4
                        },
                        {
                            "code": "080205",
                            "des": "板金工、薄铁工、钳工、剪床工",
                            "val": 4
                        },
                        {
                            "code": "080206",
                            "des": "车床工、铣床工、钻床工",
                            "val": 4
                        },
                        {
                            "code": "080207",
                            "des": "车床工（全自动）",
                            "val": 4
                        },
                        {
                            "code": "080208",
                            "des": "铸造工、冲床工",
                            "val": 4
                        },
                        {
                            "code": "080209",
                            "des": "装配工",
                            "val": 4
                        },
                        {
                            "code": "080210",
                            "des": "品管人员",
                            "val": 2
                        },
                        {
                            "code": "080211",
                            "des": "电镀工",
                            "val": 4
                        },
                        {
                            "code": "080212",
                            "des": "锅炉工",
                            "val": 4
                        },
                        {
                            "code": "080213",
                            "des": "铅字铸造工",
                            "val": 4
                        },
                        {
                            "code": "080214",
                            "des": "搬运工人",
                            "val": 4
                        },
                        {
                            "code": "080215",
                            "des": "铲车工",
                            "val": 4
                        },
                        {
                            "code": "080216",
                            "des": "仓库管理员",
                            "val": 2
                        },
                        {
                            "code": "080217",
                            "des": "行车司机",
                            "val": 2
                        },
                        {
                            "code": "080218",
                            "des": "行车指挥人员",
                            "val": 3
                        }
                    ],
                    "des": "0802机械加工业"
                },
                {
                    "children": [
                        {
                            "code": "080301",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080302",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "080303",
                            "des": "装配工、操作自动I.C制作人员",
                            "val": 2
                        },
                        {
                            "code": "080304",
                            "des": "制造工",
                            "val": 2
                        },
                        {
                            "code": "080305",
                            "des": "包装工人",
                            "val": 2
                        },
                        {
                            "code": "080306",
                            "des": "修理工",
                            "val": 2
                        },
                        {
                            "code": "080307",
                            "des": "冷冻修理工",
                            "val": 2
                        },
                        {
                            "code": "080308",
                            "des": "家电用品维修人员",
                            "val": 2
                        },
                        {
                            "code": "080309",
                            "des": "维护工程师",
                            "val": 1
                        },
                        {
                            "code": "080310",
                            "des": "系统工程师",
                            "val": 1
                        },
                        {
                            "code": "080311",
                            "des": "销售工程师",
                            "val": 1
                        }
                    ],
                    "des": "0803电子、电机制造业"
                },
                {
                    "children": [
                        {
                            "code": "080401",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "080402",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "080403",
                            "des": "一般工人",
                            "val": 3
                        },
                        {
                            "code": "080404",
                            "des": "拆船工人",
                            "val": 4
                        }
                    ],
                    "des": "0804造船、修船业"
                },
                {
                    "children": [
                        {
                            "code": "080501",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "080502",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080503",
                            "des": "制造工人（汽、机车）",
                            "val": 2
                        },
                        {
                            "code": "080504",
                            "des": "制造工人（自行车）",
                            "val": 2
                        },
                        {
                            "code": "080505",
                            "des": "喷漆工",
                            "val": 2
                        },
                        {
                            "code": "080506",
                            "des": "试车人员",
                            "val": 4
                        },
                        {
                            "code": "080507",
                            "des": "修理保养工人",
                            "val": 2
                        }
                    ],
                    "des": "0805汽车、机车、自行车制造修理业"
                },
                {
                    "children": [
                        {
                            "code": "080601",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080602",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "080603",
                            "des": "一般工人",
                            "val": 2
                        },
                        {
                            "code": "080604",
                            "des": "采掘工",
                            "val": 5
                        },
                        {
                            "code": "080605",
                            "des": "爆破工",
                            "val": 0
                        },
                        {
                            "code": "080606",
                            "des": "木炭、砖块制造工",
                            "val": 2
                        },
                        {
                            "code": "080607",
                            "des": "石棉瓦工",
                            "val": 2
                        }
                    ],
                    "des": "0806水泥业(包括石灰、石膏)"
                },
                {
                    "children": [
                        {
                            "code": "080701",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "080702",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080703",
                            "des": "一般工人",
                            "val": 2
                        },
                        {
                            "code": "080704",
                            "des": "硫酸、盐酸、硝酸制造工、有毒物品制造工",
                            "val": 0
                        },
                        {
                            "code": "080705",
                            "des": "电池制造（技师）",
                            "val": 2
                        },
                        {
                            "code": "080706",
                            "des": "电池制造（工人）",
                            "val": 3
                        },
                        {
                            "code": "080707",
                            "des": "液化气体制造工",
                            "val": 5
                        },
                        {
                            "code": "080708",
                            "des": "火药爆竹制造及处理人员（包括爆竹、烟火制造工）",
                            "val": 0
                        }
                    ],
                    "des": "0807化学原料业"
                },
                {
                    "children": [
                        {
                            "code": "080801",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080802",
                            "des": "监工",
                            "val": 2
                        },
                        {
                            "code": "080803",
                            "des": "造纸厂工人",
                            "val": 2
                        },
                        {
                            "code": "080804",
                            "des": "纸浆厂工人",
                            "val": 2
                        },
                        {
                            "code": "080805",
                            "des": "纸箱制造工人",
                            "val": 2
                        },
                        {
                            "code": "080806",
                            "des": "设计师",
                            "val": 1
                        },
                        {
                            "code": "080807",
                            "des": "领班、监工",
                            "val": 2
                        }
                    ],
                    "des": "0808造纸工业"
                },
                {
                    "children": [
                        {
                            "code": "080901",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "080902",
                            "des": "裁、缝、纫工",
                            "val": 2
                        },
                        {
                            "code": "080903",
                            "des": "制造工人",
                            "val": 2
                        },
                        {
                            "code": "080904",
                            "des": "切棉、压边工",
                            "val": 2
                        },
                        {
                            "code": "080905",
                            "des": "染整工人",
                            "val": 2
                        },
                        {
                            "code": "080906",
                            "des": "吹气、毛粘、填料、堆绵工",
                            "val": 2
                        },
                        {
                            "code": "080907",
                            "des": "质检员",
                            "val": 1
                        }
                    ],
                    "des": "0809纺织、成衣、床枕垫制造业"
                },
                {
                    "children": [
                        {
                            "code": "081001",
                            "des": "领班",
                            "val": 2
                        },
                        {
                            "code": "081002",
                            "des": "晒革工",
                            "val": 2
                        },
                        {
                            "code": "081003",
                            "des": "皮革切割工",
                            "val": 2
                        },
                        {
                            "code": "081004",
                            "des": "皮革制品制造工",
                            "val": 2
                        },
                        {
                            "code": "081005",
                            "des": "皮革制品修理工",
                            "val": 2
                        },
                        {
                            "code": "081006",
                            "des": "包装工",
                            "val": 2
                        }
                    ],
                    "des": "0810皮革业"
                },
                {
                    "children": [
                        {
                            "code": "081101",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "081102",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081103",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "081104",
                            "des": "一般工人",
                            "val": 2
                        },
                        {
                            "code": "081105",
                            "des": "塑胶射出成型工人",
                            "val": 3
                        },
                        {
                            "code": "081106",
                            "des": "检验员",
                            "val": 2
                        }
                    ],
                    "des": "0811塑胶、橡胶业"
                },
                {
                    "children": [
                        {
                            "code": "081201",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081202",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "081203",
                            "des": "木制家具制造工人",
                            "val": 2
                        },
                        {
                            "code": "081204",
                            "des": "木制家具修理工人",
                            "val": 2
                        },
                        {
                            "code": "081205",
                            "des": "金属家具制造工人",
                            "val": 2
                        },
                        {
                            "code": "081206",
                            "des": "金属家具修理工",
                            "val": 2
                        },
                        {
                            "code": "081207",
                            "des": "油漆工",
                            "val": 3
                        }
                    ],
                    "des": "0812家具制造业"
                },
                {
                    "children": [
                        {
                            "code": "081301",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081302",
                            "des": "吹玻璃工、切玻璃工、压边工、上色工、磨光工、烧玻璃熔炉工",
                            "val": 3
                        }
                    ],
                    "des": "0813玻璃、镜片制造业"
                },
                {
                    "children": [
                        {
                            "code": "081401",
                            "des": "竹木制手工艺品加工工人",
                            "val": 2
                        },
                        {
                            "code": "081402",
                            "des": "竹木制手工艺品雕刻工人",
                            "val": 2
                        },
                        {
                            "code": "081403",
                            "des": "金属手工艺品加工工人",
                            "val": 2
                        },
                        {
                            "code": "081404",
                            "des": "金属手工艺品雕刻工人",
                            "val": 2
                        },
                        {
                            "code": "081405",
                            "des": "布类制品工艺品加工工人",
                            "val": 2
                        },
                        {
                            "code": "081406",
                            "des": "矿石手工艺品加工人员",
                            "val": 2
                        }
                    ],
                    "des": "0814手工艺品业"
                },
                {
                    "children": [
                        {
                            "code": "081501",
                            "des": "陶瓷制品工人",
                            "val": 2
                        },
                        {
                            "code": "081502",
                            "des": "搪瓷制品工人",
                            "val": 2
                        }
                    ],
                    "des": "0815陶瓷、搪瓷制造业"
                },
                {
                    "children": [
                        {
                            "code": "081601",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081602",
                            "des": "工人",
                            "val": 2
                        }
                    ],
                    "des": "0816电线电缆业"
                },
                {
                    "children": [
                        {
                            "code": "081701",
                            "des": "化工制品研究员",
                            "val": 2
                        },
                        {
                            "code": "081702",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081703",
                            "des": "化妆品生产工人",
                            "val": 2
                        },
                        {
                            "code": "081704",
                            "des": "肥皂及洗洁精制造工人",
                            "val": 2
                        },
                        {
                            "code": "081705",
                            "des": "香料制造工人",
                            "val": 2
                        },
                        {
                            "code": "081706",
                            "des": "染料、颜料、涂料生产工人",
                            "val": 2
                        },
                        {
                            "code": "081707",
                            "des": "胶水生产工人",
                            "val": 2
                        },
                        {
                            "code": "081708",
                            "des": "化肥生产工人",
                            "val": 2
                        },
                        {
                            "code": "081709",
                            "des": "杀虫剂生产工人",
                            "val": 2
                        },
                        {
                            "code": "081710",
                            "des": "制药厂工人",
                            "val": 2
                        },
                        {
                            "code": "081711",
                            "des": "绝缘材料生产工人",
                            "val": 2
                        },
                        {
                            "code": "081712",
                            "des": "暴身于有毒化合物之工人",
                            "val": 3
                        }
                    ],
                    "des": "0817化工、化学制品业"
                },
                {
                    "children": [
                        {
                            "code": "081801",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "081802",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "081803",
                            "des": "制造工人",
                            "val": 2
                        },
                        {
                            "code": "081804",
                            "des": "装罐工人",
                            "val": 2
                        },
                        {
                            "code": "081805",
                            "des": "冰块制造",
                            "val": 2
                        }
                    ],
                    "des": "0818饮料、罐头制造业"
                },
                {
                    "children": [
                        {
                            "code": "081901",
                            "des": "乳品加工工人",
                            "val": 2
                        },
                        {
                            "code": "081902",
                            "des": "糖果制造工人",
                            "val": 2
                        },
                        {
                            "code": "081903",
                            "des": "粮油食品制作工",
                            "val": 2
                        },
                        {
                            "code": "081904",
                            "des": "调味品制作工",
                            "val": 2
                        },
                        {
                            "code": "081905",
                            "des": "食品添加剂工",
                            "val": 2
                        },
                        {
                            "code": "081906",
                            "des": "白酒\酒精生产工",
                            "val": 2
                        },
                        {
                            "code": "081907",
                            "des": "葡萄酒生产工",
                            "val": 2
                        }
                    ],
                    "des": "0819食品生产"
                },
                {
                    "children": [
                        {
                            "code": "082001",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "082002",
                            "des": "工人、机器操作员",
                            "val": 2
                        }
                    ],
                    "des": "0820烟草、雪茄制造业"
                },
                {
                    "children": [
                        {
                            "code": "082101",
                            "des": "技师",
                            "val": 2
                        },
                        {
                            "code": "082102",
                            "des": "一般制造工人",
                            "val": 2
                        },
                        {
                            "code": "082103",
                            "des": "装配工",
                            "val": 2
                        },
                        {
                            "code": "082104",
                            "des": "包装工",
                            "val": 2
                        },
                        {
                            "code": "082105",
                            "des": "焊接工",
                            "val": 3
                        },
                        {
                            "code": "082106",
                            "des": "车床工、铣床工、钻床工",
                            "val": 3
                        },
                        {
                            "code": "082107",
                            "des": "车床工（全自动）",
                            "val": 3
                        },
                        {
                            "code": "082108",
                            "des": "铸造工、冲床工",
                            "val": 3
                        },
                        {
                            "code": "082109",
                            "des": "剪床工",
                            "val": 3
                        }
                    ],
                    "des": "0821家电制造业"
                },
                {
                    "children": [
                        {
                            "code": "082201",
                            "des": "一般操作工人",
                            "val": 2
                        },
                        {
                            "code": "082202",
                            "des": "装配工",
                            "val": 2
                        },
                        {
                            "code": "082203",
                            "des": "检验工",
                            "val": 2
                        },
                        {
                            "code": "082204",
                            "des": "乐器制作工人",
                            "val": 2
                        },
                        {
                            "code": "082205",
                            "des": "体育用品制作工人",
                            "val": 2
                        }
                    ],
                    "des": "0822文化体育、文具制造业"
                }
            ],
            "des": "08制造业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "090101",
                            "des": "内勤人员",
                            "val": 1
                        },
                        {
                            "code": "090102",
                            "des": "外勤记者",
                            "val": 2
                        },
                        {
                            "code": "090103",
                            "des": "摄影记者",
                            "val": 2
                        },
                        {
                            "code": "090104",
                            "des": "战地记者",
                            "val": 0
                        },
                        {
                            "code": "090105",
                            "des": "出版商",
                            "val": 1
                        },
                        {
                            "code": "090106",
                            "des": "推销员",
                            "val": 2
                        },
                        {
                            "code": "090107",
                            "des": "排版工",
                            "val": 2
                        },
                        {
                            "code": "090108",
                            "des": "装订工",
                            "val": 2
                        },
                        {
                            "code": "090109",
                            "des": "印刷工",
                            "val": 2
                        },
                        {
                            "code": "090110",
                            "des": "送报员",
                            "val": 2
                        }
                    ],
                    "des": "0901新闻报纸杂志业"
                },
                {
                    "children": [
                        {
                            "code": "090201",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "090202",
                            "des": "业务员",
                            "val": 2
                        },
                        {
                            "code": "090203",
                            "des": "广告影片拍摄录制人员",
                            "val": 2
                        },
                        {
                            "code": "090204",
                            "des": "广告招牌绘制人员（地面）",
                            "val": 2
                        },
                        {
                            "code": "090205",
                            "des": "广告招牌绘制人员（高空）",
                            "val": 6
                        },
                        {
                            "code": "090206",
                            "des": "广告招牌制作架设人员",
                            "val": 6
                        }
                    ],
                    "des": "0902广告业"
                }
            ],
            "des": "09新闻出版\n广告业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "100101",
                            "des": "行政人员",
                            "val": 1
                        },
                        {
                            "code": "100102",
                            "des": "一般医生及护士",
                            "val": 1
                        },
                        {
                            "code": "100103",
                            "des": "精神病科医师、看护及护士",
                            "val": 2
                        },
                        {
                            "code": "100104",
                            "des": "传染病科医师及护士",
                            "val": 2
                        },
                        {
                            "code": "100105",
                            "des": "放射线\核医学医生",
                            "val": 2
                        },
                        {
                            "code": "100106",
                            "des": "放射线\核医学技术人员",
                            "val": 2
                        },
                        {
                            "code": "100107",
                            "des": "放射线\核医学设备维护人员",
                            "val": 2
                        },
                        {
                            "code": "100108",
                            "des": "病理分析员",
                            "val": 1
                        },
                        {
                            "code": "100109",
                            "des": "跌打损伤治疗人员",
                            "val": 1
                        },
                        {
                            "code": "100110",
                            "des": "助产士、齿模技工",
                            "val": 1
                        },
                        {
                            "code": "100111",
                            "des": "清洁工、杂工",
                            "val": 1
                        },
                        {
                            "code": "100112",
                            "des": "监狱、看守所医生、护理人员",
                            "val": 1
                        }
                    ],
                    "des": "1001医院、诊所"
                },
                {
                    "children": [
                        {
                            "code": "100201",
                            "des": "行政人员",
                            "val": 1
                        },
                        {
                            "code": "100202",
                            "des": "一般医生及护士",
                            "val": 1
                        },
                        {
                            "code": "100203",
                            "des": "消毒人员",
                            "val": 1
                        }
                    ],
                    "des": "1002防疫、保健人员"
                }
            ],
            "des": "10卫生保健"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "110101",
                            "des": "影片商",
                            "val": 1
                        },
                        {
                            "code": "110102",
                            "des": "制片人、编剧",
                            "val": 1
                        },
                        {
                            "code": "110103",
                            "des": "导演",
                            "val": 1
                        },
                        {
                            "code": "110104",
                            "des": "一般演员",
                            "val": 1
                        },
                        {
                            "code": "110105",
                            "des": "武打演员",
                            "val": 5
                        },
                        {
                            "code": "110106",
                            "des": "特技演员",
                            "val": 0
                        },
                        {
                            "code": "110107",
                            "des": "武术指导",
                            "val": 4
                        },
                        {
                            "code": "110108",
                            "des": "化妆师",
                            "val": 1
                        },
                        {
                            "code": "110109",
                            "des": "场记",
                            "val": 1
                        },
                        {
                            "code": "110110",
                            "des": "摄影、录制工作人员",
                            "val": 1
                        },
                        {
                            "code": "110111",
                            "des": "灯光及音响效果工作人员",
                            "val": 1
                        },
                        {
                            "code": "110112",
                            "des": "烟火特效师",
                            "val": 3
                        },
                        {
                            "code": "110113",
                            "des": "冲片工作人员",
                            "val": 1
                        },
                        {
                            "code": "110114",
                            "des": "洗片工作人员",
                            "val": 1
                        },
                        {
                            "code": "110115",
                            "des": "机械工、电工",
                            "val": 2
                        },
                        {
                            "code": "110116",
                            "des": "布景搭设人员",
                            "val": 2
                        },
                        {
                            "code": "110117",
                            "des": "电影院售票人员",
                            "val": 1
                        },
                        {
                            "code": "110118",
                            "des": "电影院放映和服务人员",
                            "val": 1
                        }
                    ],
                    "des": "1101影视业"
                },
                {
                    "children": [
                        {
                            "code": "110201",
                            "des": "歌手",
                            "val": 1
                        },
                        {
                            "code": "110202",
                            "des": "作曲、编曲、音乐指挥",
                            "val": 1
                        },
                        {
                            "code": "110203",
                            "des": "演奏人员",
                            "val": 1
                        },
                        {
                            "code": "110204",
                            "des": "舞蹈人员、",
                            "val": 1
                        },
                        {
                            "code": "110205",
                            "des": "戏剧演员",
                            "val": 1
                        },
                        {
                            "code": "110206",
                            "des": "巡回演出杂技团人员（包括高空杂技、飞车、飞人等）",
                            "val": 0
                        }
                    ],
                    "des": "1102演艺界"
                },
                {
                    "children": [
                        {
                            "code": "110301",
                            "des": "作家",
                            "val": 1
                        },
                        {
                            "code": "110302",
                            "des": "绘画人员",
                            "val": 1
                        },
                        {
                            "code": "110303",
                            "des": "雕塑人员",
                            "val": 1
                        },
                        {
                            "code": "110304",
                            "des": "书法、篆刻家",
                            "val": 1
                        }
                    ],
                    "des": "1103艺术"
                },
                {
                    "children": [
                        {
                            "code": "110401",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "110402",
                            "des": "教练",
                            "val": 1
                        },
                        {
                            "code": "110403",
                            "des": "球场保养工人",
                            "val": 1
                        },
                        {
                            "code": "110404",
                            "des": "维护工人",
                            "val": 1
                        },
                        {
                            "code": "110405",
                            "des": "球童",
                            "val": 1
                        }
                    ],
                    "des": "1104高尔夫球场"
                },
                {
                    "children": [
                        {
                            "code": "110501",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "110502",
                            "des": "维护工人",
                            "val": 1
                        },
                        {
                            "code": "110503",
                            "des": "计分员",
                            "val": 1
                        }
                    ],
                    "des": "1105保龄球馆"
                },
                {
                    "children": [
                        {
                            "code": "110601",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "110602",
                            "des": "维护工人",
                            "val": 1
                        }
                    ],
                    "des": "1106桌球馆"
                },
                {
                    "children": [
                        {
                            "code": "110701",
                            "des": "教练",
                            "val": 1
                        },
                        {
                            "code": "110702",
                            "des": "售票员",
                            "val": 1
                        },
                        {
                            "code": "110703",
                            "des": "救生员",
                            "val": 1
                        }
                    ],
                    "des": "1107游泳池"
                },
                {
                    "children": [
                        {
                            "code": "110801",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "110802",
                            "des": "售票员",
                            "val": 1
                        },
                        {
                            "code": "110803",
                            "des": "救生员",
                            "val": 2
                        }
                    ],
                    "des": "1108海水浴场"
                },
                {
                    "children": [
                        {
                            "code": "110901",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "110902",
                            "des": "售票员",
                            "val": 1
                        },
                        {
                            "code": "110903",
                            "des": "电动游乐器具操作员",
                            "val": 1
                        },
                        {
                            "code": "110904",
                            "des": "一般清洁工",
                            "val": 1
                        },
                        {
                            "code": "110905",
                            "des": "兽栏清洁工",
                            "val": 3
                        },
                        {
                            "code": "110906",
                            "des": "水电机械工",
                            "val": 2
                        },
                        {
                            "code": "110907",
                            "des": "动物园驯兽师",
                            "val": 3
                        },
                        {
                            "code": "110908",
                            "des": "饲养人员",
                            "val": 3
                        },
                        {
                            "code": "110909",
                            "des": "兽医（动物园）",
                            "val": 3
                        }
                    ],
                    "des": "1109游乐园、动物园"
                },
                {
                    "children": [
                        {
                            "code": "111001",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "111002",
                            "des": "KTV、PUB工作人员",
                            "val": 2
                        },
                        {
                            "code": "111003",
                            "des": "咖啡室工作人员",
                            "val": 1
                        },
                        {
                            "code": "111004",
                            "des": "茶室工作人员",
                            "val": 1
                        },
                        {
                            "code": "111005",
                            "des": "酒家工作人员",
                            "val": 1
                        },
                        {
                            "code": "111006",
                            "des": "浴室、桑拿、沐足工作人员",
                            "val": 2
                        },
                        {
                            "code": "111007",
                            "des": "舞厅工作人员",
                            "val": 2
                        },
                        {
                            "code": "111008",
                            "des": "歌厅工作人员",
                            "val": 2
                        },
                        {
                            "code": "111009",
                            "des": "酒吧工作人员",
                            "val": 2
                        },
                        {
                            "code": "111010",
                            "des": "舞女、按摩师",
                            "val": 3
                        },
                        {
                            "code": "111011",
                            "des": "网吧、游戏厅工作人员",
                            "val": 1
                        }
                    ],
                    "des": "1110特种营业"
                }
            ],
            "des": "11影视娱乐业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "120101",
                            "des": "教师",
                            "val": 1
                        },
                        {
                            "code": "120102",
                            "des": "学生（军警校除外）（17周岁以下）",
                            "val": 1
                        },
                        {
                            "code": "120103",
                            "des": "学生（军警校除外）（18周岁以上）",
                            "val": 1
                        },
                        {
                            "code": "120104",
                            "des": "校工",
                            "val": 1
                        },
                        {
                            "code": "120105",
                            "des": "军训教官",
                            "val": 2
                        },
                        {
                            "code": "120106",
                            "des": "体育教师",
                            "val": 1
                        },
                        {
                            "code": "120107",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "120108",
                            "des": "图书馆工作人员",
                            "val": 1
                        },
                        {
                            "code": "120109",
                            "des": "博物馆工作人员",
                            "val": 1
                        },
                        {
                            "code": "120110",
                            "des": "考古及文物保护工作人员",
                            "val": 2
                        },
                        {
                            "code": "120111",
                            "des": "汽车驾驶训练班教练",
                            "val": 2
                        }
                    ],
                    "des": "1201教育文化机构"
                },
                {
                    "children": [
                        {
                            "code": "120201",
                            "des": "管理人员",
                            "val": 1
                        },
                        {
                            "code": "120202",
                            "des": "科研工作者",
                            "val": 1
                        },
                        {
                            "code": "120203",
                            "des": "科学考察人员",
                            "val": 3
                        }
                    ],
                    "des": "1202科研机构"
                }
            ],
            "des": "12科教文化"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "130101",
                            "des": "寺庙及教堂管理人员",
                            "val": 1
                        },
                        {
                            "code": "130102",
                            "des": "宗教团体工作人员",
                            "val": 1
                        },
                        {
                            "code": "130103",
                            "des": "僧尼、道士及传教人员",
                            "val": 1
                        }
                    ],
                    "des": "1301寺庙教堂"
                }
            ],
            "des": "13宗教"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "140101",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "140102",
                            "des": "外勤邮务人员",
                            "val": 2
                        },
                        {
                            "code": "140103",
                            "des": "快递人员（骑摩托车）",
                            "val": 4
                        },
                        {
                            "code": "140104",
                            "des": "快递人员（骑自行车、助动车）",
                            "val": 3
                        },
                        {
                            "code": "140105",
                            "des": "包裹搬运人员",
                            "val": 2
                        }
                    ],
                    "des": "1401邮政快递"
                },
                {
                    "children": [
                        {
                            "code": "140201",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "140202",
                            "des": "总工程师",
                            "val": 1
                        },
                        {
                            "code": "140203",
                            "des": "电机工程师",
                            "val": 2
                        },
                        {
                            "code": "140204",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "140205",
                            "des": "高压线路带电检修工人",
                            "val": 0
                        },
                        {
                            "code": "140206",
                            "des": "变压器操作人员",
                            "val": 0
                        },
                        {
                            "code": "140207",
                            "des": "编结电缆工人、拉线工人",
                            "val": 5
                        },
                        {
                            "code": "140208",
                            "des": "电力设施架设人员",
                            "val": 5
                        },
                        {
                            "code": "140209",
                            "des": "住宅拉线工人",
                            "val": 4
                        },
                        {
                            "code": "140210",
                            "des": "设备检修工",
                            "val": 3
                        },
                        {
                            "code": "140211",
                            "des": "安装、修理电表工人",
                            "val": 3
                        },
                        {
                            "code": "140212",
                            "des": "抄表、收费员",
                            "val": 2
                        },
                        {
                            "code": "140213",
                            "des": "电力输送员",
                            "val": 2
                        }
                    ],
                    "des": "1402电力"
                },
                {
                    "children": [
                        {
                            "code": "140301",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "140302",
                            "des": "工程师",
                            "val": 1
                        },
                        {
                            "code": "140303",
                            "des": "领班、监工",
                            "val": 2
                        },
                        {
                            "code": "140304",
                            "des": "架设电缆、电线工人",
                            "val": 4
                        },
                        {
                            "code": "140305",
                            "des": "技工、中汇站测试员、装配工人",
                            "val": 3
                        },
                        {
                            "code": "140306",
                            "des": "拉线及维修工人",
                            "val": 4
                        },
                        {
                            "code": "140307",
                            "des": "电信工程设施架设人员",
                            "val": 5
                        },
                        {
                            "code": "140308",
                            "des": "电台天线维护人员",
                            "val": 4
                        }
                    ],
                    "des": "1403电信业"
                },
                {
                    "children": [
                        {
                            "code": "140401",
                            "des": "水坝、水库管理员",
                            "val": 2
                        },
                        {
                            "code": "140402",
                            "des": "水利工程设施人员",
                            "val": 2
                        },
                        {
                            "code": "140403",
                            "des": "自来水管装修人员",
                            "val": 2
                        },
                        {
                            "code": "140404",
                            "des": "抄表员、收费员",
                            "val": 2
                        },
                        {
                            "code": "140405",
                            "des": "自来水厂水质分析员（实地）",
                            "val": 2
                        }
                    ],
                    "des": "1404自来水"
                },
                {
                    "children": [
                        {
                            "code": "140501",
                            "des": "工程师",
                            "val": 2
                        },
                        {
                            "code": "140502",
                            "des": "管线装修工",
                            "val": 2
                        },
                        {
                            "code": "140503",
                            "des": "抄表员、收费员",
                            "val": 2
                        },
                        {
                            "code": "140504",
                            "des": "检查员",
                            "val": 2
                        },
                        {
                            "code": "140505",
                            "des": "燃气器具铸造工",
                            "val": 2
                        },
                        {
                            "code": "140506",
                            "des": "燃气储气槽、燃气分装工",
                            "val": 3
                        }
                    ],
                    "des": "1405燃气"
                }
            ],
            "des": "14公共事业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "150101",
                            "des": "个体商贩（固定摊位）",
                            "val": 2
                        },
                        {
                            "code": "150102",
                            "des": "个体商贩（流动摊位）",
                            "val": 2
                        },
                        {
                            "code": "150103",
                            "des": "杂货商",
                            "val": 1
                        },
                        {
                            "code": "150104",
                            "des": "古董商",
                            "val": 1
                        },
                        {
                            "code": "150105",
                            "des": "银楼、当铺工作人员",
                            "val": 1
                        },
                        {
                            "code": "150106",
                            "des": "珠宝商",
                            "val": 1
                        },
                        {
                            "code": "150107",
                            "des": "花卉商",
                            "val": 1
                        },
                        {
                            "code": "150108",
                            "des": "服饰买卖商",
                            "val": 1
                        },
                        {
                            "code": "150109",
                            "des": "绸布商",
                            "val": 1
                        },
                        {
                            "code": "150110",
                            "des": "农具商",
                            "val": 1
                        },
                        {
                            "code": "150111",
                            "des": "化学原料、农药商",
                            "val": 2
                        },
                        {
                            "code": "150112",
                            "des": "玻璃商",
                            "val": 1
                        },
                        {
                            "code": "150113",
                            "des": "陶瓷器商",
                            "val": 1
                        },
                        {
                            "code": "150114",
                            "des": "石材商",
                            "val": 1
                        },
                        {
                            "code": "150115",
                            "des": "建材商",
                            "val": 1
                        },
                        {
                            "code": "150116",
                            "des": "钢材商",
                            "val": 1
                        },
                        {
                            "code": "150117",
                            "des": "木材商",
                            "val": 1
                        },
                        {
                            "code": "150118",
                            "des": "五金商",
                            "val": 1
                        },
                        {
                            "code": "150119",
                            "des": "电器商",
                            "val": 1
                        },
                        {
                            "code": "150120",
                            "des": "卫生器材商",
                            "val": 1
                        },
                        {
                            "code": "150121",
                            "des": "家具商",
                            "val": 1
                        },
                        {
                            "code": "150122",
                            "des": "汽车买卖商",
                            "val": 1
                        },
                        {
                            "code": "150123",
                            "des": "机动车买卖商",
                            "val": 1
                        },
                        {
                            "code": "150124",
                            "des": "车辆器材商",
                            "val": 1
                        },
                        {
                            "code": "150125",
                            "des": "矿物油买卖商、香蚀买卖商",
                            "val": 1
                        },
                        {
                            "code": "150126",
                            "des": "眼镜商",
                            "val": 1
                        },
                        {
                            "code": "150127",
                            "des": "食品商",
                            "val": 1
                        },
                        {
                            "code": "150128",
                            "des": "文具商",
                            "val": 1
                        },
                        {
                            "code": "150129",
                            "des": "米商",
                            "val": 1
                        },
                        {
                            "code": "150130",
                            "des": "鱼贩",
                            "val": 2
                        },
                        {
                            "code": "150131",
                            "des": "肉贩",
                            "val": 3
                        },
                        {
                            "code": "150132",
                            "des": "屠夫",
                            "val": 3
                        },
                        {
                            "code": "150133",
                            "des": "果菜商",
                            "val": 1
                        },
                        {
                            "code": "150134",
                            "des": "药品买卖商",
                            "val": 1
                        },
                        {
                            "code": "150135",
                            "des": "医疗机械仪器商",
                            "val": 1
                        },
                        {
                            "code": "150136",
                            "des": "手工艺品买卖商",
                            "val": 1
                        },
                        {
                            "code": "150137",
                            "des": "厨具商",
                            "val": 1
                        },
                        {
                            "code": "150138",
                            "des": "燃气器具商、店员",
                            "val": 1
                        },
                        {
                            "code": "150139",
                            "des": "燃气器具装设工",
                            "val": 1
                        },
                        {
                            "code": "150140",
                            "des": "液化气零售商、店员",
                            "val": 1
                        },
                        {
                            "code": "150141",
                            "des": "液化气送货员",
                            "val": 2
                        },
                        {
                            "code": "150142",
                            "des": "零售店燃气分装工",
                            "val": 2
                        },
                        {
                            "code": "150143",
                            "des": "旧货收购人员",
                            "val": 2
                        }
                    ],
                    "des": "1501商业"
                }
            ],
            "des": "15商业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "160101",
                            "des": "一般内勤人员",
                            "val": 1
                        },
                        {
                            "code": "160102",
                            "des": "业务员",
                            "val": 1
                        },
                        {
                            "code": "160103",
                            "des": "人保寿险业务员",
                            "val": 1
                        },
                        {
                            "code": "160104",
                            "des": "收费员",
                            "val": 1
                        },
                        {
                            "code": "160105",
                            "des": "调查员",
                            "val": 1
                        },
                        {
                            "code": "160106",
                            "des": "征信人员",
                            "val": 1
                        },
                        {
                            "code": "160107",
                            "des": "现金运送人员",
                            "val": 4
                        }
                    ],
                    "des": "1601银行、保险、信托、证券、典当"
                }
            ],
            "des": "16金融保险业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "170101",
                            "des": "土地房屋买卖经纪人",
                            "val": 1
                        },
                        {
                            "code": "170102",
                            "des": "公证行外务员",
                            "val": 1
                        },
                        {
                            "code": "170103",
                            "des": "报关行外务员",
                            "val": 1
                        },
                        {
                            "code": "170104",
                            "des": "理发师",
                            "val": 1
                        },
                        {
                            "code": "170105",
                            "des": "美容师",
                            "val": 1
                        },
                        {
                            "code": "170106",
                            "des": "美容院\发廊小工",
                            "val": 1
                        },
                        {
                            "code": "170107",
                            "des": "钟表匠",
                            "val": 1
                        },
                        {
                            "code": "170108",
                            "des": "鞋匠、伞匠",
                            "val": 1
                        },
                        {
                            "code": "170109",
                            "des": "洗衣店工人",
                            "val": 1
                        },
                        {
                            "code": "170110",
                            "des": "加油站人员",
                            "val": 2
                        },
                        {
                            "code": "170111",
                            "des": "停车场管理和收费员",
                            "val": 1
                        },
                        {
                            "code": "170112",
                            "des": "道路清洁工",
                            "val": 3
                        },
                        {
                            "code": "170113",
                            "des": "下水道清洁工",
                            "val": 3
                        },
                        {
                            "code": "170114",
                            "des": "清洁、打杂工人",
                            "val": 1
                        },
                        {
                            "code": "170115",
                            "des": "高楼外部清洁工",
                            "val": 0
                        },
                        {
                            "code": "170116",
                            "des": "烟囱清洁工",
                            "val": 0
                        },
                        {
                            "code": "170117",
                            "des": "大楼管理员",
                            "val": 1
                        },
                        {
                            "code": "170118",
                            "des": "摄影师",
                            "val": 1
                        },
                        {
                            "code": "170119",
                            "des": "佣人",
                            "val": 1
                        }
                    ],
                    "des": "1701服务业"
                },
                {
                    "children": [
                        {
                            "code": "170201",
                            "des": "律师",
                            "val": 2
                        },
                        {
                            "code": "170202",
                            "des": "会计师",
                            "val": 1
                        },
                        {
                            "code": "170203",
                            "des": "自由投资人（股票、期货、黄金等）",
                            "val": 1
                        },
                        {
                            "code": "170204",
                            "des": "经纪人",
                            "val": 1
                        }
                    ],
                    "des": "1702自由业"
                },
                {
                    "children": [
                        {
                            "code": "170301",
                            "des": "殡仪服务员",
                            "val": 1
                        },
                        {
                            "code": "170302",
                            "des": "尸体接运工",
                            "val": 4
                        },
                        {
                            "code": "170303",
                            "des": "尸体防腐工",
                            "val": 4
                        },
                        {
                            "code": "170304",
                            "des": "尸体整容工",
                            "val": 2
                        },
                        {
                            "code": "170305",
                            "des": "尸体火化工",
                            "val": 3
                        },
                        {
                            "code": "170306",
                            "des": "墓地管理员",
                            "val": 2
                        }
                    ],
                    "des": "1703殡葬服务人员"
                },
                {
                    "children": [
                        {
                            "code": "170401",
                            "des": "系统工程师",
                            "val": 1
                        },
                        {
                            "code": "170402",
                            "des": "维护工程师",
                            "val": 2
                        },
                        {
                            "code": "170403",
                            "des": "销售工程师",
                            "val": 1
                        }
                    ],
                    "des": "1704资讯业"
                }
            ],
            "des": "17服务业"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "180101",
                            "des": "家庭主妇",
                            "val": 1
                        },
                        {
                            "code": "180102",
                            "des": "家政服务人员",
                            "val": 2
                        }
                    ],
                    "des": "1801家庭管理"
                }
            ],
            "des": "18家庭管理"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "190101",
                            "des": "行政及内勤人员",
                            "val": 1
                        },
                        {
                            "code": "190102",
                            "des": "警察（负有巡逻任务者）",
                            "val": 3
                        },
                        {
                            "code": "190103",
                            "des": "监狱看守所管理人员",
                            "val": 2
                        },
                        {
                            "code": "190104",
                            "des": "交通警察",
                            "val": 4
                        },
                        {
                            "code": "190105",
                            "des": "刑警",
                            "val": 5
                        },
                        {
                            "code": "190106",
                            "des": "消防队人员",
                            "val": 5
                        },
                        {
                            "code": "190107",
                            "des": "防爆警察及负有防爆任务警员",
                            "val": 6
                        },
                        {
                            "code": "190108",
                            "des": "拆弹警员",
                            "val": 0
                        },
                        {
                            "code": "190109",
                            "des": "武警官兵",
                            "val": 4
                        },
                        {
                            "code": "190110",
                            "des": "警校学生",
                            "val": 0
                        },
                        {
                            "code": "190111",
                            "des": "调查局外勤人员、治安调查人员",
                            "val": 3
                        },
                        {
                            "code": "190112",
                            "des": "港口、机场、火车站警卫及安全人员",
                            "val": 2
                        },
                        {
                            "code": "190113",
                            "des": "民航随机空警",
                            "val": 6
                        }
                    ],
                    "des": "1901公安、安全局"
                },
                {
                    "children": [
                        {
                            "code": "190201",
                            "des": "法官、检察官",
                            "val": 1
                        },
                        {
                            "code": "190202",
                            "des": "一般工作人员",
                            "val": 1
                        },
                        {
                            "code": "190203",
                            "des": "法院、检察院调查人员",
                            "val": 2
                        }
                    ],
                    "des": "1902法院、检察院"
                },
                {
                    "children": [
                        {
                            "code": "190301",
                            "des": "保安人员（工厂、公司、大楼等）",
                            "val": 2
                        },
                        {
                            "code": "190302",
                            "des": "警卫人员（负有巡逻\押运任务者及司机）",
                            "val": 3
                        }
                    ],
                    "des": "1903保安"
                },
                {
                    "children": [
                        {
                            "code": "190401",
                            "des": "行政及内勤人员（国防部、三军总部、军校教官等）",
                            "val": 1
                        },
                        {
                            "code": "190402",
                            "des": "后勤补给及通讯地勤人员",
                            "val": 1
                        },
                        {
                            "code": "190403",
                            "des": "军医院官兵",
                            "val": 1
                        },
                        {
                            "code": "190404",
                            "des": "军事研究单位设计人员",
                            "val": 1
                        },
                        {
                            "code": "190405",
                            "des": "一般地面部队人员（含陆军野战、机械修护、土木工程、导弹、战车及空军炮、飞机维护等）",
                            "val": 4
                        },
                        {
                            "code": "190406",
                            "des": "军事单位武器弹药研究及管理人员",
                            "val": 3
                        },
                        {
                            "code": "190407",
                            "des": "空军飞行官兵、海军舰艇及潜艇官兵",
                            "val": 0
                        },
                        {
                            "code": "190408",
                            "des": "前线军人",
                            "val": 0
                        },
                        {
                            "code": "190409",
                            "des": "军校学生及入伍受训新军特种部队（海军陆战队、伞兵、水兵）",
                            "val": 0
                        },
                        {
                            "code": "190410",
                            "des": "爆破兵、蛙人、化学兵、爆破任务兵、情报单位负有特殊任务者",
                            "val": 0
                        },
                        {
                            "code": "190411",
                            "des": "航天基地发射操作人员",
                            "val": 4
                        },
                        {
                            "code": "190412",
                            "des": "航天基地发射指挥人员",
                            "val": 2
                        },
                        {
                            "code": "190413",
                            "des": "航天员",
                            "val": 0
                        }
                    ],
                    "des": "1904现役军人"
                },
                {
                    "children": [
                        {
                            "code": "190501",
                            "des": "预备役军人、民兵",
                            "val": 2
                        }
                    ],
                    "des": "1905预备役军人"
                }
            ],
            "des": "19治安人员、军人"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "200101",
                            "des": "教练人员、裁判人员",
                            "val": 2
                        },
                        {
                            "code": "200102",
                            "des": "高尔夫球球员",
                            "val": 1
                        },
                        {
                            "code": "200103",
                            "des": "高尔夫球球童",
                            "val": 1
                        },
                        {
                            "code": "200104",
                            "des": "保龄球球员",
                            "val": 1
                        },
                        {
                            "code": "200105",
                            "des": "桌球球员",
                            "val": 1
                        },
                        {
                            "code": "200106",
                            "des": "羽毛球球员",
                            "val": 1
                        },
                        {
                            "code": "200107",
                            "des": "排球球员",
                            "val": 2
                        },
                        {
                            "code": "200108",
                            "des": "篮球球员",
                            "val": 2
                        },
                        {
                            "code": "200109",
                            "des": "网球球员",
                            "val": 1
                        },
                        {
                            "code": "200110",
                            "des": "垒球球员",
                            "val": 1
                        },
                        {
                            "code": "200111",
                            "des": "手球球员",
                            "val": 1
                        },
                        {
                            "code": "200112",
                            "des": "乒乓球球员",
                            "val": 1
                        },
                        {
                            "code": "200113",
                            "des": "棒球球员",
                            "val": 1
                        },
                        {
                            "code": "200114",
                            "des": "足球球员",
                            "val": 5
                        },
                        {
                            "code": "200115",
                            "des": "曲棍球球员",
                            "val": 3
                        },
                        {
                            "code": "200116",
                            "des": "冰球球员",
                            "val": 5
                        },
                        {
                            "code": "200117",
                            "des": "橄榄球球员",
                            "val": 5
                        },
                        {
                            "code": "200118",
                            "des": "水球球员",
                            "val": 2
                        },
                        {
                            "code": "200119",
                            "des": "巧固球球员",
                            "val": 2
                        }
                    ],
                    "des": "2001球类"
                },
                {
                    "children": [
                        {
                            "code": "200201",
                            "des": "运动员",
                            "val": 2
                        },
                        {
                            "code": "200202",
                            "des": "教练",
                            "val": 1
                        }
                    ],
                    "des": "2002田径"
                },
                {
                    "children": [
                        {
                            "code": "200301",
                            "des": "举重人员",
                            "val": 2
                        },
                        {
                            "code": "200302",
                            "des": "教练",
                            "val": 5
                        }
                    ],
                    "des": "2003举重"
                },
                {
                    "children": [
                        {
                            "code": "200401",
                            "des": "击剑运动员",
                            "val": 6
                        },
                        {
                            "code": "200402",
                            "des": "教练",
                            "val": 5
                        }
                    ],
                    "des": "2004击剑"
                },
                {
                    "children": [
                        {
                            "code": "200501",
                            "des": "游泳运动员",
                            "val": 2
                        },
                        {
                            "code": "200502",
                            "des": "跳水运动员",
                            "val": 2
                        },
                        {
                            "code": "200503",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2005游泳"
                },
                {
                    "children": [
                        {
                            "code": "200601",
                            "des": "柔道运动员",
                            "val": 5
                        },
                        {
                            "code": "200602",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2006柔道"
                },
                {
                    "children": [
                        {
                            "code": "200701",
                            "des": "空手道运动员",
                            "val": 5
                        },
                        {
                            "code": "200702",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2007空手道"
                },
                {
                    "children": [
                        {
                            "code": "200801",
                            "des": "跆拳道运动员",
                            "val": 5
                        },
                        {
                            "code": "200802",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2008跆拳道"
                },
                {
                    "children": [
                        {
                            "code": "200901",
                            "des": "拳击运动员",
                            "val": 6
                        },
                        {
                            "code": "200902",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2009拳击"
                },
                {
                    "children": [
                        {
                            "code": "201001",
                            "des": "摔跤运动员",
                            "val": 5
                        },
                        {
                            "code": "201002",
                            "des": "教练",
                            "val": 2
                        }
                    ],
                    "des": "2010摔跤"
                },
                {
                    "children": [
                        {
                            "code": "201101",
                            "des": "射击人员",
                            "val": 1
                        },
                        {
                            "code": "201102",
                            "des": "射箭人员",
                            "val": 1
                        },
                        {
                            "code": "201103",
                            "des": "教练",
                            "val": 1
                        }
                    ],
                    "des": "2011射击、射箭"
                },
                {
                    "children": [
                        {
                            "code": "201201",
                            "des": "体操人员",
                            "val": 2
                        },
                        {
                            "code": "201202",
                            "des": "教练",
                            "val": 3
                        }
                    ],
                    "des": "2012体操"
                },
                {
                    "children": [
                        {
                            "code": "201301",
                            "des": "马术运动员",
                            "val": 6
                        },
                        {
                            "code": "201302",
                            "des": "教练",
                            "val": 3
                        }
                    ],
                    "des": "2013马术"
                },
                {
                    "children": [
                        {
                            "code": "201401",
                            "des": "划船运动员",
                            "val": 2
                        },
                        {
                            "code": "201402",
                            "des": "划船教练",
                            "val": 1
                        },
                        {
                            "code": "201403",
                            "des": "帆船运动员、教练",
                            "val": 3
                        },
                        {
                            "code": "201404",
                            "des": "摩托艇运动员、教练",
                            "val": 4
                        },
                        {
                            "code": "201405",
                            "des": "风浪板运动员、教练",
                            "val": 4
                        },
                        {
                            "code": "201406",
                            "des": "冲浪运动员、教练",
                            "val": 4
                        },
                        {
                            "code": "201407",
                            "des": "赛艇运动员、教练",
                            "val": 4
                        }
                    ],
                    "des": "2014水上运动"
                },
                {
                    "children": [
                        {
                            "code": "201501",
                            "des": "潜水运动员",
                            "val": 0
                        },
                        {
                            "code": "201502",
                            "des": "教练",
                            "val": 0
                        }
                    ],
                    "des": "2015潜水运动"
                },
                {
                    "children": [
                        {
                            "code": "201601",
                            "des": "滑冰运动员",
                            "val": 3
                        },
                        {
                            "code": "201602",
                            "des": "滑雪运动员",
                            "val": 5
                        },
                        {
                            "code": "201603",
                            "des": "教练",
                            "val": 1
                        }
                    ],
                    "des": "2016冰雪运动"
                },
                {
                    "children": [
                        {
                            "code": "201701",
                            "des": "极限运动员",
                            "val": 0
                        },
                        {
                            "code": "201702",
                            "des": "教练",
                            "val": 0
                        }
                    ],
                    "des": "2017极限运动"
                },
                {
                    "children": [
                        {
                            "code": "201801",
                            "des": "高风险运动运动员（空中运动、赛\n车、登山、攀岩、探险、特技表演）",
                            "val": 0
                        },
                        {
                            "code": "201802",
                            "des": "高风险运动教练",
                            "val": 0
                        }
                    ],
                    "des": "2018高风险运动"
                },
                {
                    "children": [
                        {
                            "code": "201901",
                            "des": "武术运动员",
                            "val": 1
                        },
                        {
                            "code": "201902",
                            "des": "教练",
                            "val": 1
                        }
                    ],
                    "des": "2019武术"
                },
                {
                    "children": [
                        {
                            "code": "202001",
                            "des": "健美运动员",
                            "val": 1
                        },
                        {
                            "code": "202002",
                            "des": "自行车运动员",
                            "val": 2
                        },
                        {
                            "code": "202003",
                            "des": "自行车教练",
                            "val": 2
                        },
                        {
                            "code": "202004",
                            "des": "民俗体育活动人员（非竞技性）",
                            "val": 1
                        }
                    ],
                    "des": "2020其他"
                }
            ],
            "des": "20体育"
        },
        {
            "children": [
                {
                    "children": [
                        {
                            "code": "210101",
                            "des": "公、检、法、工商、税务、城管、卫生检验等执法监督人员",
                            "val": 2
                        }
                    ],
                    "des": "2101执法监督"
                },
                {
                    "children": [
                        {
                            "code": "210201",
                            "des": "自营投资业者",
                            "val": 1
                        }
                    ],
                    "des": "2102自营投资"
                },
                {
                    "children": [
                        {
                            "code": "210301",
                            "des": "无固定职业人员",
                            "val": 2
                        },
                        {
                            "code": "210302",
                            "des": "无业人员、下岗人员",
                            "val": 2
                        },
                        {
                            "code": "210303",
                            "des": "学龄前儿童",
                            "val": 3
                        },
                        {
                            "code": "210304",
                            "des": "离退休人员（无兼职）",
                            "val": 1
                        }
                    ],
                    "des": "2103无业"
                },
                {
                    "children": [
                        {
                            "code": "210401",
                            "des": "村委会、居委会人员",
                            "val": 1
                        }
                    ],
                    "des": "2104其他"
                }
            ],
            "des": "21其他"
        }
    ]
    },
    "info": "success",
    "success": true
}
export  default  data;